Revit 2024 API
BuiltInFailures.AutoRouteFailures.FailedDowngradeCrossToTee Property
 Failed to downgrade cross type to tee type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FailedDowngradeCrossToTee { get; }
Visual Basic
Public Shared ReadOnly Property FailedDowngradeCrossToTee As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FailedDowngradeCrossToTee {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace